a, b = (1, 2)
print(a)
print(b)

print("__________________* - использется для распаковки оставшегося кортеджа____________________")
head, *tail = [1, 2, 3, 4, 5]
print(head)
print(tail)

print("____________________Если при расраковке не указать *other будет выведен отдельный list___________________")
a, b, *other, z = [1, 2, 3, 4, 5]
print(a, b, z, other)
print("________________Игнорирование____________")

a, *_ = [7, 2, 3, 4]
print(a)


a = [1, 2, 3]
b = [4, 5, 6]
c = [*a, *b]

print(c)

a.extend(b)
print(a)
